# Группа 1
# 1.Вывести числа от 1 до 10 кроме четных
# 2.Выведите все числа от 1 до 20 но остановитесь как только дойдет до 7
# 3.Выведите числа от 1 до 15 пропуская те что делятся на 3 без остатка
# 4.Пройдите по списку [12,34,78,5,90,23] и выведите первое число больше 50 затем остановитесь

# 5.Запрашивайте пароль пока пользователь не введет "pyton максимум 3 попытки потом выход"

# 6.Запрашивайте числа пока не введен 0 считайте сумму если введено отрицательное пропустите его
# 7.Дан список имен найдите есть ли в нем "Оля" если есть выведите "Нашли" если нет то "Нет в списке" 
# 8.дан список [3, -1, 5, -7, 2, -4, 8] Выведите только положительные числа
# 9.Программа загадывает число от 1 до 20 пользователь угадывает но у него максимум 5 попыток
# есть подсказки больше/меньше если не угадал то проигрыш
# 10.Дан список [1, 2, 3, 2, 5, 6] Идите по нему и остановителсь как только встретите число которе уже было раньше 

# Группа 2 
# 1. Выведите все простые числа от 2 до N используя вложенные циклы и break
# 2. Запросите высоту h и нарисуйте пирамиду
# 3.Выведите таблицу умножения от 1 до 9 но пропустите строки где первый множитель четный и остановитесь когда первый множитель равен 8 
# 4. Запросите строку и идите по символам 
# если символ это цифра остановитесь
# если гласная то увеличте счетчик остальные пропускайте 
# выведите колличество гласных до первой цифры 
# 5.Банкомат где начальная сумма 1000
# есть меню где 1- пополнить 2-снять 3-показать баланс 0-выход
# при снятии больше баланса отказ 
# при неверной команде пропустить
# при 0 выйти и показать итоговый баланс